#Напишите программу, которая принимает на вход вещественное число (float) и печатает
#его следующим образом (например):
#10000.035295 = 10,000.04
#4.00000241 = 4.00



number = float(input("Введите вещественное число: "))
formatted_number = "{:.2f}".format(number)
print(formatted_number.replace(".", ","))