#Напишите программу, решающую следующую задачу:
#На чемпионате по футболу команде за выигрыш дается 3 очка, за проигрыш — 0, за ничью
#— 1. Известно количество очков, полученных командой за игру. Определить словесный
#результат игры (выигрыш, проигрыш или ничья). Число вводится с консоли




points = int(input("Введите количество очков: "))

if points == 3:
    print("Выигрыш")
elif points == 1:
    print("Ничья")
else:
    print("Проигрыш")