#Напишите программу, которая принимает строку и меняет регистр всех букв на
#противоположный.

string = input("Введите строку: ")
inverted_string = string.swapcase()
print(inverted_string)