#Напишите программу, предлагающую пользователю ввести число от 10 до 20. Если
#веденное значение меньше 10, выведите сообщение «Число меньше требуемого
#диапазона» и предложите повторить попытку. Если введенное значение больше 20,
#выведите сообщение «Число больше требуемого диапазона» и предложите повторить
#попытку. Повторяйте до тех пор, пока не будет введено значение из диапазона от 10 до 20,
#после чего выведите сообщение «Спасибо».




num = int(input("Введите число от 10 до 20: "))

while num <= 10 or num >= 20:
    if num <= 10:
        print("Число меньше требуемого диапазона")
    else:
        print("Число больше требуемого диапазона")
    num = int(input("Повторите попытку: "))

print("Спасибо")