#Напишите программу, предлагающую пользователю ввести сначала имя, а затем фамилию
#– все через input(). Соедините их в одну строку, разделив фамилию и имя пробелом, после
#чего выведите полученную строку и ее длину.

name = input("Введите имя:")
username = input("Введите фамилию:")
fullname = name + username
print("Полное имя:", name, username)
lenght = len(fullname)
print("Длина полного имени:", lenght)