#Напишите программу, которая работает следующим образом:
#Создайте список с названиями четырех телевизионных передач и выведите их на отдельных
#строках. Предложите пользователю ввести название еще одной передачи и позицию, на
#которой она должна быть вставлена в список. Снова выведите список, в котором все пять
#передач находятся на новых позициях.


shows =["Serega Pirat", "MUZTV", "+100500", "Hata NIXA"]

print("Список передач:")
for show in shows:
    print(show)

new_show = input("Введите название новой передачи:")
position = int(input("Введите позицию на которой она должная быть вставлена:"))

shows.insert(position, new_show)
print("\nОбновленный список передач:")
for show in shows:
    print(show)
