#Напишите программу, которая проверяет, является ли число – числом Армстронга
#(нарциссическим числом)

def arm_num(number):
    
    #преобразую число в строку чтобы получить количество цифр
    num_str = str(number)
    num_digits = len(num_str)

    #Инициализирую сумму
    total = 0

    #Складываю каждую цифру возведенную в степень количества цифр
    for digit in num_str:
        total += int(digit) ** num_digits

    #Если сумма равна исходному числу то это число армстронга
    if total == number:
        return True
    else:
        return False

    #Получаем число от пользователя

number = int(input("Введите число:"))

#Проверяем явл. ли число армстронгом
if arm_num(number):
    print(number,"является числом Армстронга")
else:
    print(number, "не является числом Армстронга")
