#Напишите программу, которая работает следующим образом:
#Программа выводит названия пяти цветов, случайным образом программа выбирает один
#и предлагает сделать то же пользователю. Если пользователь выберет тот же цвет, который
#выбрала программа, выводится сообщение «Отлично!»; в противном случае выводится
#ответ, в котором скрывается намек на правильный цвет. Если цвета не совпадают,
#программа также предлагает пользователю повторить попытку; если пользователь и на этот
#раз не угадает, снова выводится та же подсказка и предлагается выбрать цвет (и так далее,
#пока пользователь не выдаст правильный ответ)



import random

colors = ["Red", "Blue", "Green", "Yellow", "Orange"]
random_color = random.choice(colors)

while True:
    user_color = input("Выберите один из цветов: Red, Blue, Green, Yellow, Orange:")

    if user_color == random_color:
        print("Отлично")
        break
    else:
        print("Неправильный цвет. Попробуйте еще раз.")

        if random_color in colors:
            hint_index = colors.index(random_color) + 1
            hint = colors[hint_index] if hint_index < len(colors) else colors[0]
            print(f"Подсказка: Цвет, который я выбрал имеет букву '{hint[0]}' в своем названии.")
            print()

        print("Программа завершена.")