#Напишите программу, которая принимает строку и делает заглавной первую букву
#каждого слова в этой строке.



string = input("Введите строку: ")
capitalized_string = string.title()
print(capitalized_string)