#Напишите программу, которая запрашивает у пользователя его имя и возраст, а затем
#выводит приветственное сообщение в формате "Привет, {имя}! Тебе уже {возраст} лет."

name = input("Введите имя:")
age = input("Введите возраст:")
print(f"Привет, {name}! Тебе уже {age} лет.")