#Напишите программу, которая запрашивает у пользователя два числа и выводит их
#произведение в формате "Произведение чисел {a} и {b} равно {произведение}".


a = int(input("Введите число a:"))
b = int(input("Введите число b:"))
c = a*b
print(f"Произведение чисел {a} и {b} равно {c}.")