#Напишите программу, предлагающую пользователю ввести имя через input(). Выведите
#длину имени.

name = input("Введите имя: ")
length = len(name)
print("Длина имени", name, "равна", length, "символам")





